01  RECORD.
05 RECORD_TYPE PIC X(005).
05 CORRECTION_IND PIC X(01).
05 MANAGEMENT_CODE PIC X(08).
05 FUND PIC X(10).
05 FUND_INDICATOR_TYPE PIC X(1).
05 PRICE_EFF_DATE PIC X(8).
05 PRICE_VERIFY_DTE PIC X(8).
05 PRICE PIC 9(9)V9(6).
05 NET_CHANGE_PRICE PIC 9(9)V9(6).
05 NET_CHG_PRICE_SIGN_CDE PIC X(1).
05 OFFER_PRICE PIC 9(9)V9(6).
05 SHARES_OUTSTNDG PIC 9(12)V9(3).
05 NET_CHG_SHR_OUT PIC 9(12)V9(3).
05 NET_CHG_SHR_OUT_SIGN_CDE PIC X(1).
05 TOTAL_NET_ASSETS PIC 9(11)V9(4).
05 RATE_EFF_DATE PIC 9(8).
05 RATE_VERIFY_DTE PIC 9(8).
05 DAILY_DIV_RATE PIC 9(6)V9(9).
05 NET_CHANGE_RATE PIC 9(6)V9(9).
05 NET_CHG_RATE_SIGN_CDE PIC X(1).
05 FOOTNOTES PIC X(1).
05 SEVEN_DAY_YIELD PIC 9(4)V9(4).
05 SEVEN_DAY_EFF_YLD PIC 9(4)V9(4).
05 AVG_DAYS_TO_MAT PIC 9999.
05 RECORD_SPARE PIC X(49).